SinglePhase/RANS/singlePhasePeriodic/system/FOs/FOsubtract
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

subtract1
{
    // Mandatory entries
    type            subtract;
    libs            (fieldFunctionObjects);
    fields          (k k_0);

    // Optional (inherited) entries
    result          kDiff;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         10;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    runTime;
    writeInterval   1;
}


// ************************************************************************* //
