SinglePhase/RANS/singlePhasePeriodic/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

createPatchDict
{
    // Name of the new patch
    patchName    periodicPatch;

    // Tell OF that this patch is a true cyclic (matching meshes) 
    patchInfo
    {
        type    cyclicAMI;
    }

    // constructing from two existing patches:
    constructFrom    Patches;
    Patches         ( Inlet Outlet );


}

